case/outputs_shutin/openfoam_cases/section_3_x30p4km/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 3.2889);

boundaryField
{
    inlet   { type fixedValue; value uniform (0 0 3.2889); }
    outlet  { type pressureInletOutletVelocity; value uniform (0 0 0); }
    walls   { type noSlip; }
}
