case/outputs_shutin/openfoam_cases/section_3_x30p4km/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 23.0968;

boundaryField
{
    inlet   { type fixedValue; value uniform 23.0968; }
    outlet  { type inletOutlet; inletValue uniform 23.0968; value uniform 23.0968; }
    walls   { type omegaWallFunction; value uniform 23.0968; }
}
