case/outputs_shutin/openfoam_cases/section_3_x30p4km/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volScalarFieldValue alpha.liquid 0 );

regions
(
    boxToCell
    {
        box (-0.07635 -0.07635 -0.01) (0.07635 0.039096 1.8424);
        fieldValues ( volScalarFieldValue alpha.liquid 1 );
    }
);
